# CouplerCoupledBarSize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerCoupledBarSize Property
ParameterTypeId Class See Also
---
"Bar Size 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerCoupledBarSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerCoupledBarSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerCoupledBarSize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace